// import React, { Component } from 'react';

// class TermsAr extends Component {

//     render() {
//         return (
//             <div>
//                  <div className="privacyPolicyBlue">
//                     <div className="Title">
//                     سياسة الخصوصية
//                     </div>
//                 </div>
//                 <div className="termsCondition">
//       <div className="aboutusContentdiv">
//          <div className="aboutusContentmaindiv">
//             <p className="aboutusContentmain">مرحباً بكم في موقع elctoys.com الإلكتروني ("الموقع"). يُدار الموقع من قبل متجر ليغو المعتمد (فرع مجموعة كمال عثمان جمجوم ذ.م.م)، العلامة التجارية رقم 221286 لمجموعة كمال عثمان جمجوم ذ.م.م. مركز سلطان للأعمال، الطابق الرابع، الوحدة 422، شارع عود ميثاء، دبي - الإمارات العربية المتحدة (المشار إليه هنا بـ متجر ـLEGO المعتمد"، "نحن" و"لنا").</p>
//             <p className="aboutusContentmain">يخضع دخولك إلى هذا الموقع واستخدامه إلى أحكام وشروط الاستخدام ("شروط الاستخدام"). تشير شروط الاستخدام هذه إلى سياسة خصوصيتنا وشروط بيعنا وقد تنطبق على استخدامك لهذا الموقع أيضاً.</p>
//             <p className="aboutusContentmain">إذا كنت لا توافق على شروط الاستخدام هذه، فلا يجب عليك استخدام هذا الموقع. يرجى التحقق من هذه الشروط بشكل دوري حيث من الممكن أن يتم التعديل عليهم من وقت لآخر واستخدامك المستمر لهذا الموقع يعني أنك موافق على التغييرات التي طرأت على هذه الشروط.</p>
//             <div className="quesAns">
//                <p className="quesDiv">استخدام الموقع</p>
//                <p className="quesDiv">يمكنك فقط أن تستخدم هذا الموقع:</p>
//                <p className="AnsDiv">إن كان عمرك على الأقل 18 سنة أو تستخدمه تحت إشراف أحد الوالدين أو الوصي القانوني؛ و
// استخدامك هذا يمثلك أنت ونيابة عنك وليس لغرض تجاري ما لم تكن مخولاً بذلك من قبلنا.</p>
//                <p className="AnsDiv">يجب أن تكون المعلومات التي تقدمها لنا أو تدخلها في الموقع لغرض التسجيل أو الاشتراك صحيحة وحديثة. يجب تحديث هذه المعلومات على الفور في حال طرأ تغيير عليها. تتحمل وحدك مسؤولية الحفاظ على كلمات السر ومعرفات الحساب الأخرى آمنة وأنت المسؤول بشكل كامل عن جميع النشاطات التي تجري تحت حسابك أو كلمة السر الخاصة بك. يجب عليك إعلامنا بأي استخدام غير مصرح به لحسابك أو كلمة السر الخاصة بك.</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">تقديمات المستخدم</p>
//                <p className="AnsDiv">أي شيء ترسله عبر الموقع و/أو تقدمه إلينا بما في ذلك على سبيل المثال لا الحصر، الأسئلة، المراجعات، التعليقات والاقتراحات (تعرف معاً باسم "التقديمات") سيصبح من ملكيتنا الخاصة ويمنحنا ذلك الحق باستخدام اسمك فيما له علاقة بهكذا تقديمات. يجوز لنا، لكن ليس بالضرورة، أن نحذف أو نعدل على أي تقديم.
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">الملكية الفكرية</p>
//                <p className="AnsDiv"> -، متجر ليغو المعتمد" هو علامة تجارية مسجلة لدينا. نحن المالكون والمرخص لهم بجميع حقوق الملكية الفكرية المسجلة وغير المسجلة الموجودة في"- الموقع وجميع المحتويات المنشورة على الموقع ("المحتويات")، وتصميم الموقع بما في ذلك على سبيل المثال لا الحصر، النصوص، الرسومات، البرمجيات الصور، الفيديوهات، الموسيقى، الأصوات واختيارهم وترتيبهم وجميع المحولات البرمجية، الشيفرة المصدرية والبرمجية. يمكنك تنزيل وطباعة نسخة واحدة .من مقتطفاتنا الموجودة على الموقع للاستخدام الشخصي. لا يجوز لك استخدام ملكيتنا لأي غرض آخر</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">لا تعتمد على المعلومات</p>
//                <p className="AnsDiv">الغرض من المحتويات المزودة هو إعلامي فقط. على الرغم من أننا نبذل جهداً معقولاً لتوفير محتوى دقيق وحديث، إلا أننا لا نقدم أي إقرار ولا نوفر أي ضماناً على إثره.</p>
              
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">الحد من المسؤولية</p>
//                <p className="AnsDiv"> إلى الحد الذي يسمح به القانون، نستبعد جميع الشروط، الضمانات، الإقرارات أو أي أحكام أخرى مما قد ينطبق على الموقع أو المحتوى، سواء كانت ضمنية أو صريحة. لن نكون مسؤولين تجاهك عن أي خسارة أو ضرر (بما في ذلك الضرر المباشر أو التبعي) تتعرض له نتيجة استخدامك لهذا الموقع بما في ذلك على سبيل المثال لا الحصر ما يصيبك نتيجة استخدامك أو عدم قدرتك على استخدام هذا الموقع، أي اعتماد على أي محتوى، أي فيروس أو أذى تقني يصيب جهازك الحاسوب من خلال استخدام الموقع وأي استخدام لموقع إلكتروني موصول بهذا الموقع وأي استخدام لكلمة السر الخاصة بك أو حسابك (سواء مخول به أو لا).</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">القانون المعمول به</p>
//                <p className="AnsDiv">يخضع تطبيق هذه الشروط وتفسيرها لتشريعات الإمارات العربية المتحدة بحيث تطبق في إمارة دبي.
//                </p>
            
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">النزاعات</p>
//                <p className="AnsDiv">في حال نشوء أي خلاف، مطالبة أو نزاع نتيجة لشروط الاستخدام هذه أو له علاقة بها يتم الرجوع إليها وتسويتها من قبل تحكيم خاص وسري أمام مُحكم واحد يعقد في دبي، الإمارات العربية المتحدة باللغة الإنجليزية وتحكمه تشريعات دبي وفقاً لقواعد المصالحة التجارية والتحكيم لعام 1994 (دبي)، بصيغتها المعدلة، المستبدلة أو المُعاد تشريعها من وقت لآخر. يجب أن يكون المُحكم شخصاً مدرباً قانونياً ولديه خبرة في مجال تكنولوجيا المعلومات في دبي ومستقل عن أي من الطرفين. على الرغم مما أسلف سابقاً، نحتفظ بحقنا في مواصلة حماية حقوقنا فيما يتعلق بحقوق الملكية الفكرية والمعلومات السرية من خلال المحاكم. لهذا الغرض، أنت توافق على الخضوع للولاية القضائية الخاصة بمحاكم دبي.</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">شروط وأحكام البيع</p>
//                <p className="quesDiv">1. التطبيق</p>
//                <p className="AnsDiv"> 
// يتم عرض وبيع المنتجات المدرجة في هذا الموقع ("المنتجات") وفقاً لشروط وأحكام البيع، بصيغتها المعدلة من وقت لآخر ("شروط البيع"). قد نقوم بتعديل شروط البيع هذه في أي وقت والنسخة المعمول بها عندما تقوم بطلب شيء من المنتجات ("طلب") ستكون الشروط التي تنطبق على العقد المبرم بيننا بشأن هذا الطلب. ترد الشروط والأحكام الأخرى التي قد تنطبق عليك في شروط الاستخدام وسياسة خصوصيتنا. كما تنطبق التعاريف المستخدمة في شروط الاستخدام على شروط البيع أيضاً. يرجى قراءة شروط البيع، شروط الاستخدام وسياسية الخصوصية قبل كل مرة وفي كل مرة تطلب فيها.</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">2. القيود العمرية</p>
//                <p className="AnsDiv">
// لا يجوز لك التقدم بطلب شراء لأي منتج ما لم تكن فوق سن 18.</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">3. المنتجات</p>
//                <p className="AnsDiv">صور المنتجات هي لأغراض توضيحية فقط. على الرغم من أننا نبذل جهداً معقولاً لعرض ألوان المنتج وجوانبه الأخرى بدقة، إلا أنه قد يكون هناك اختلافات</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">4. الطلبات</p>
//                <p className="AnsDiv">عد إجراء طلبك، سنرسل لك رسالة إلكترونية تؤكد الاستلام. ومع ذلك، قبول طلبك لا يحصل إلا عندما تصلك رسالة إلكترونية منا تخبرك بأن طلبك قد تم إرساله. لا يمكننا أن نضم أن جميع المنتجات متاحة للشراء على الدوام. إذا لم نتمكن من تلبية طلبك، سنخبرك بذلك من خلال رسالة إلكترونية وإن كنت قد دفعت للطلب، قم باسترجاع المبلغ كامل.</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">5. سعار المنتج</p>
//                <p className="AnsDiv">سيتم تحديد سعر المنتج على الموقع في الوقت الذي ترسل فيه طلبك. سعر المنتج لا يشمل رسوم التوصيل أو الرسوم المصرفية. على الرغم من أننا نحرص على تسعير منتجاتنا بشكل صحيح، قد تكون هناك حالات لا يكون فيها السعر صحيح. في حال اكتشفنا خطأ فيجوز لنا حسب تقديرنا إما أن نلغي الطلب أو .نتواصل معك لنعطيك الخيار في شراء المنتج بسعره الصحيح أو إلغاء الطلب</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">6. الدفع</p>
//                <p className="AnsDiv">
//                قبل الدفع عبر الإنترنت بواسطة بطاقة فيزا وماستر كارد المدينة/الدائنة. سيتم تزويد مزود الدفع الخاص بنا بمعلومات الدفع الخاصة بك عبر اتصال آمن ولن .يتم تخزينها على الموقع. يجب عليك أن تحتفظ بنسخة من سجلات معاملاتك، شروط البيع، شروط الاستخدام وسياسة الخصوصية
//                </p>
//                <p className="AnsDiv mb-0">د يتم الدفع بهذه العملة:</p>
//                <p className="AnsDiv mb-0">د.إ. درهم إماراتي في الإمارات العربية المتحدة</p>
//                <p className="AnsDiv mb-0">.س. ريال سعودي في المملكة العربية السعودية</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">7. التوصيل</p>
//                <p className="AnsDiv">
//                تعامل مع أرامكس لتوصيل جميع طلباتنا. يمكن استعراض مواعيد التسليم والظروف الأخرى هنا. لا نبيع المنتجات أو نوصلها إلى الدول الممنوعة من قبل تشريعات الإمارات العربية المتحدة أو مكتب مراقبة الأصول الأجنبية. قد يخضع طلبك لرسوم جمركية وضرائب عند الوصول إلى وجهته. ليست لدينا أي سيطرة على هذه الرسوم ولا يمكننا التنبؤ بقيمتها - يرجى التواصل مع أرامكس أو مع مكتب الجمارك المحلي للحصول على مزيد من المعلومات أو انقر هنا .للعرض
// يمكن تقسيم طلب واحد إلى شحنات متعددة بالاعتماد على توفر العناصر و/أو الوزن المسموح به للطرد. يجب أن تكون على دراية بأن الشحنات المتعددة قد .تتسبب بترحيلات متعددة من بيان بطاقتك الائتمانية الدائنة أو المدينة الشهري
// يمكن تقسيم طلب واحد إلى شحنات متعددة بالاعتماد على توفر العناصر و/أو الوزن المسموح به للطرد. يجب أن تكون على دراية بأن الشحنات المتعددة قد .تتسبب بترحيلات متعددة من بيان بطاقتك الائتمانية الدائنة أو المدينة الشهري
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv"> 8. الإرجاع</p>
//                <p className="AnsDiv">
                  
// بسياسة الترجيع المسهلة التي تقدمها. نقبل بتبديل أو إرجاع المنتج بشرط lego.saudistore.com تفخر
// إرجاع المنتج خلال 14 يوم من تاريخ التوصيل (أو فيما يتعلق بالمنتج المخصوم، فترة البيع المعنية في حال كانت أقصر)؛
// يتم إرجاع المنتج مع إيصاله الأصلي (لن يتم قبول البيان المصرفي)؛
// المنتج غير مفتوح، غير مستخدم وفي عبوته الأصلية و
// إن كان قد تم شراء المنتج ضمن عرض خاص متعدد الشراء، يتم إرجاع جميع المنتجات المبتاعة في الوقت نفسه.
// يتم استرداد المبلغ من خلال طريقة الدفع الأصلية. لا نعيد المبلغ الخاص بالتوصيل إلا في حال كان المنتج معيباً أو لم يكن المنتج الذي طلبته.
// يمكنك إرجاع المنتج إلى أي من متاجر ليغو المعتمدة في المملكة العربية السعودية أو يمكنك الاتصال بفريق خدمة العملاء على الرقم 8001180009 أو .إرسال بريد إلكتروني لترجع منتجك بواسطة البريد أو الناقل
// .يجب أن يحتفظ حامل البطاقة بنسخة من سجلات العملية المالية وسياسات وقواعد التاجر
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">9.لقانون المعمول به</p>
//                <p className="AnsDiv">
//                تخضع شروط البيع هذه لتشريعات الإمارات العربية المتحدة المطبقة في إمارة دبي. بذلك أنت توافق على الخضوع للولاية القضائية التابعة لمحاكم دبي في .حال حدوث نزاع
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">10.  الأسئلة الأكثر شيوعاً</p>
//                <p className="AnsDiv">
                
// .يرجى النقر هنا لإستعراض الأسئلة الأكثر شيوعاً
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv"> 11. فاصيل الاتصال</p>
//                <p className="AnsDiv mb-0">عنوان البريدي: صندوق بريد 27844، دبي - الإمارات العربية المتحدةE</p>
//                <p className="AnsDiv mb-0">العنوان الفعلي: الطابق الرابع، الوحدة 422، شارع عود ميثاء، دبي - الإمارات العربية المتحدة</p>
//                <p className="AnsDiv mb-0">لبريد الإلكتروني:<a href="mailto:help@lego.saudistore.com" target="_top">help@lego.saudistore.com</a></p>
//                <p className="AnsDiv mb-0">الهاتف:  <a href="tel:8001180009">8001180009</a></p>
//             </div>
//          </div>
//       </div>
//    </div>
//             </div>
//         )
//     }
// }

// export default TermsAr;
