// import React, { Component } from 'react';

// class PrivacyPolicyArabic extends Component {

//     render() {
//         return (
//             <div>
//                  <div className="privacyPolicyBlue">
//                     <div className="Title">
//                     سياسة الخصوصية
//                     </div>
//                 </div>
//                 <div className="privacyPolicy">
//       <div className="aboutusContentdiv">
//          <div className="aboutusContentmaindiv">
//             <p className="aboutusContentmain">"متجر LEGO المعتمد (المشار إليه هنا بـ "" متجرLEGO المعتمد""، ""نحن"" و""لنا"") هي شركة أنشئت في الإمارات العربية المتحدة تحمل العلامة التجارية رقم 221286 لمجموعة كمال عثمان جمجوم ذ.م.م. مركز سلطان للأعمال، الطابق الرابع، الوحدة 422، شارع عود ميثاء، دبي - الإمارات العربية المتحدة، وتُدير الشركة موقع www.elctoys.com (المشار إليه بـ""الموقع""). تشرح سياسة الخصوصية هذه كيف سنستخدم المعلومات التي نجمعها منك عند استخدامك لهذا الموقع. يخضع استخدامك لهذا الموقع أيضاً لشروط الاستخدام وفي حال شرائك لمنتج، لسياسة الإرجاع أيضاً. كما تنطبق شروط الاستخدام على سياسة الخصوصية هذه.
// "
// </p>
//             <div className="quesAns">
//                <p className="quesDiv">1. عندما نجمع معلوماتك الشخصية</p>
//                <p className="AnsDiv"> يمكنك زيارة وتصفح الموقع دون الحاجة إلى تزويدنا بأي معلومات شخصية. مع ذلك، تحتاج إلى تزويدنا بمعلوماتك الشخصية عندما تنشئ حساباً، و تطلب أو .تقوم بالتقديم</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">2. لمعلومات الشخصية التي نجمعها</p>
//                <p className="AnsDiv">تتضمن المعلومات الشخصية التي نجمعها المسمى، الاسم، الجنس، البريد الإلكتروني، العنوان البريدي، عنوان التوصيل (إذا كان مختلفاً)، رقم الهاتف ورقم .الجوال. قد نقوم أيضاً بجمع معلوماتك الشخصية منك معاً أو كجزء من التقديم
// .لا نقوم بجمع تفاصيل الدفع، تفاصيل بطاقة الدفع أو تفاصيل حساب البنك. يتم جمع هذه التفاصيل أثناء عملية الشراء من خلال مزود الدفع الخاص بنا
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">3.  معلومات أخرى نجمعها</p>
//                <p className="AnsDiv">نقوم بجمع معلومات معينة (مثل وقت وتاريخ زيارتك للموقع، الصفحات التي استعرضتها، عنوان بروتوكول الإنترنت والمتصفح المستخدم في الوصول إلى .الموقع) كلما زرت الموقع. نستخدم هذه المعلومات لفهم كيفية استخدام موقعنا والتحسين منه. تبقى هذه المعلومات مجهولة ولا يمكن ربطها بك</p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">4. كيف نستخدم معلوماتك الشخصية</p>
//                <p className="AnsDiv"> :سوف نستخدم معلوماتك الشخصية من أجل</p>
//                <ul>
//                   <li>
//                   إنشاء وإدارة حسابك، معالجة وتسليم طلباتك ومن أجل تزويدك بالخدمات والمعلومات؛
//                   </li>
//                   <li>
//                   تحسين تصميم الموقع، المحتوى والوظائف؛ و
//                   </li>
//                   <li>
//                   جراء البحوث على تركيبة المستخدمين وأذواقهم
//                   </li>
//                </ul>
//                <p className="AnsDiv">
                 
// قد نستخدم معلوماتك الشخصية لنرسل لك معلومات عن منتجاتنا وخدماتنا وتلك المقدمة من شركاتنا التابعة لنا. يمكنك الانسحاب من هذا الخيار في أي .وقت من خلال النقر على رابط "إلغاء الاشتراك" المرفق في أي من رسائل التسويق الإلكترونية التي نرسلها إليك
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">5.  مشاركة معلوماتك الشخصية مع طرف ثالث</p>
//                <p className="AnsDiv"> :سوف نتشارك معلوماتك الشخصية مع</p>
//                <ul>
//                   <li>
//                   رامكس، لأغراض توصيل الطلب؛
//                   </li>
//                   <li>
//                   أطراف ثالثة تقدم لنا الخدمات من أجل تقديم هذه الخدمات لك (على سبيل المثال، التسويق، إدارة موقع الويب وخدمات الحماية من الاحتيال)؛ و
//                   </li>
//                   <li>
//                   .مع أي سلطة حكومية أو قانونية إن كان ذلك ملزماً من قبل التشريعات
//                   </li>
//                </ul>
//                <p className="AnsDiv">                  
// .جميع تفاصيل البطاقات الدائنة أو المدينة وجميع المعرفات الشخصية لن يتم تخزينها، بيعها، مشاركتها، تأجيرها أو منحها لأي طرف ثالث
//                </p>
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">6. ستخدام المكونات الإضافية الاجتماعية</p>
//                <p className="AnsDiv">
// .يستخدم الموقع مكونات إضافية اجتماعية ("المكونات الإضافية") التي يزودها طرف ثالث مثل فيس بوك، انستجرام وبنترست ("مزود مستقل")
// عندما تزور صفحة تحتوي على مكون إضافي، سينشئ متصفحك اتصالاً مباشراً بخوادم المزودين المستقلين ذات الصلة (والتي قد تقع خارج البلاد) وسيتم نقل محتوى المكون الإضافي إلى متصفحك. بعد ذلك، سيتمكن المزود المستقل من استلام معلومات تخص وصولك إلى تلك الصفحة في الموقع. يحصل ذلك حتى في حال عدم امتلاكك لحساب على موقع المزود المستقل أو في حال لم تقم بتسجيل الدخول في ذلك الوقت. إذا كان دخولك مسجلاً على الموقع الإلكتروني الخاص بالمزود المستقل وتفاعلت مع المكونات الإضافية الموجودة على موقعنا (مثل ضغط "إعجاب" أو كتابة تعليق) فسيتم نقل المعلومات المتناظرة من متصفحك مباشرة إلى خادم المزود المستقل وسيقوم بتخزينه. يمكن أن يتم نشر المعلومات أيضاً على حسابك الموجودة على صفحة المزود المستقل وتكون .ظاهرة لأولئك الذين أعطيتهم صلاحية الدخول "الأصدقاء" وما إلى ذلك
//                </p>
//                <p className="AnsDiv">
//                كنك حظر المكونات الإضافية من خلال استخدام الملحقات في متصفحك، مثل "حاظر الفيس بوك"
// من أجل الحصول على معلومات تخض أغراض ونطاق جمع البيانات من قبل فيس بوك، انستجرام وبنترست وكيف يتم معالجتها واستخدامها، بالإضافة إلى حقوقك في هذا الصدد وخيارات الإعدادات لحماية خصوصيتك، يرجى الاطلاع على سياسة الخصوصية الخاصة بالمزود المستقل: فيس بوك، انستجرام، .بنترست
//                </p>
            
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">7. لفات تعريف الارتباط</p>
//                <p className="AnsDiv">
// ليس من الضروري قبول ملفات تعريف الارتباط لزيارة موقعنا. مع ذلك، إن كنت ترغب بالطلب أو إضافة عنصر إلى سلة مشترياتك فستحتاج إلى إعداد متصفحك ليقبل ملفات تعريف الارتباط حتى تتمكن من استخدام الوظائف ذات الصلة. ملفات تعريف الارتباط التي نستخدمها لا تُستخدم أبداً في تخزين أي معلومات شخصية ولا يمكن ربطها بالمستخدم. نستخدم المعلومات المجهولة التي تصلنا من ملفات تعريف الارتباط لفهم طريقة استخدام العملاء للموقع، لتحسين الموقع، لتصميم إعلانات تناسب أذواقكم ولجعل الموقع أسهل لاستخدامكم.</p>
//                <p className="AnsDiv">
//                ستخدم الموقع تحليلات جوجل والتي تستخدم ملفات تعريف الارتباط لتساعد في تحليل الطريقة التي تتم بها استخدام موقعنا. سيتم نقل المعلومات التي أنشئت بواسطة ملفات تعريف الارتباط عن استخدامك للموقع (بما في ذلك عنوان بروتوكول الإنترنت الخاص بك) إلى جوجل وتخزينها في خوادم في الولايات المتحدة. ستستخدم جوجل هذه المعلومات لغرض تقييم استخدامك للموقع، إعداد تقارير لمشغلي الموقع وتقديم خدمات أخرى لها علاقة بنشاط الموقع واستخدام الإنترنت. قد تقوم جوجل بنقل المعلومات إلى طرف ثالث عندما يقتضي الأمر بموجب التشريعات، أو في الحالات التي تقوم بها الأطراف الثالثة .بمعالجة المعلومات بالنيابة عن جوجل. لن تقوم جوجل بربط عنوان بروتوكول الإنترنت الخاص بك مع أي من البيانات الموجودة لدى جوجل
//                </p>
    
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">8. الأمان</p>
//                <p className="AnsDiv"> لقد اتخذنا تدابير تقنية وأمنية لنمنع أي دخول غير مصرح به إلى معلوماتك الشخصية المخزنة لدينا أو أي فقدان أو تدمير لها بصورة عرضية. نجمع معلوماتك الشخصية في خادم آمن ونستخدم جدران الحماية على خوادمنا. بينما نحن غير قادرين على ضمان الأمان بنسبة 100%، لكن هذا يصعب على المخترق فك تشفير بياناتك. الإجراءات الأمنية الخاصة بنا تعني أننا قد نطلب منك دليلاً يؤكد هويتك من حين لآخر قبل أن نفصح لك عن المعلومات الشخصية. أنت .مسؤول عن حماية حسابك وكلمة السر الخاصة بك من أي دخول غير مصرح به</p>
              
//             </div>
         
//             <div className="quesAns">
//                <p className="quesDiv">9. الموافقة</p>
//                <p className="AnsDiv">باستخدامك لموقعنا أو بتقديمك لمعلومات شخصية على موقعنا أو لوكلائنا فإنك توافق على استخدامنا لمعلوماتك الشخصية بالطريقة المنصوص عليها في سياسة الخصوصية هذه.</p>
              
//             </div>
//             <div className="quesAns">
//                <p className="quesDiv">10.  صلاحية الدخول والاتصال</p>
//                <p className="AnsDiv"> د يتم تغيير أو تحديث سياسات وشروط وأحكام الموقع الإلكتروني من حين لآخر لتلبية المتطلبات والمعايير. لذلك، فنحن نشجع العملاء على زيارة هذه .الأقسام بشكل متكرر ليتم إطلاعهم على التغييرات التي جرت على الموقع الإلكتروني. تكون التعديلات سارية المفعول في اليوم الذي تُنشر فيه</p>
//                <p className="AnsDiv">
//                مكنك أن تطلب الوصول إلى معلوماتك الشخصية ويمكنك أن تطلب تصحيح أي معلومة غير دقيقة في معلوماتك الشخصية. يحق لك في أي مرحلة أن تطلب .منا أن نتوقف عن استخدام معلوماتك الشخصية لأغراض التسويق المباشر
//                </p>
//                <p className="AnsDiv mb-0"> مكنك التواصل معنا عبر</p>
//                <p className="AnsDiv">  <a href="mailto:help@lego.saudistore.com" target="_top">help@lego.saudistore.com</a></p>
//                <p className="AnsDiv">أو</p>
//                <p className="AnsDiv mb-0"> و عبر مجموعة كمال عثمان جمجوم ذ.م.م  مركز سلطان للأعمال</p>
//                <p className="AnsDiv mb-0"> الطابق الرابع، الوحدة 422،</p>
//                <p className="AnsDiv mb-0"> شارع عود ميثاء، دبي </p>
//                <p className="AnsDiv mb-0"> الإمارات العربية المتحدة</p>
//             </div>
//          </div>
//       </div>
//    </div>
//             </div>
//         )
//     }
// }

// export default PrivacyPolicyArabic;
